{
  "created": "2025-12-01T20:02:53.79766-05:00",
  "modified": "2025-12-01T20:02:54.360803-05:00",
  "id": 17783961,
  "conceptrecid": "17783960",
  "doi": "10.5281/zenodo.17783961",
  "conceptdoi": "10.5281/zenodo.17783960",
  "doi_url": "https://doi.org/10.5281/zenodo.17783961",
  "metadata": {
    "title": "Mixed Methods Research Approach",
    "doi": "10.5281/zenodo.17783961",
    "publication_date": "2025-12-02",
    "description": "<p><span>This study aims to identify the types of mixed methods and evaluate their application in various social and educational research contexts. Mixed methods is a research approach that combines quantitative and qualitative elements within a single study to gain a more comprehensive, complementary, and holistic understanding of phenomena. This study employs a qualitative descriptive approach with systematic literature review as the primary data collection method, in which primary literature sources such as books, academic journals, and relevant research reports are critically analyzed. The results reveal three main mixed methods designs: sequential explanatory (quantitative followed by qualitative to explain findings), sequential exploratory (qualitative followed by quantitative to generalize initial findings), and convergent parallel (both data types are collected and analyzed simultaneously for comparison). Each type has distinct characteristics, design logic, and implementation stages; their selection depends heavily on the research objectives, questions, and focus. Further analysis indicates that applying mixed methods offers significant advantages, particularly in data triangulation, which enables cross-verification of findings. Other strengths include its ability to enrich analytical depth, provide richer context for statistical data, and enhance the overall validity and reliability of research outcomes. However, despite its strengths, the challenges in implementing this method cannot be overlooked. These challenges encompass greater demands on time, cost, and resources, as well as the need for researcher expertise in mastering and managing two different research paradigms simultaneously. Therefore, this study recommends the importance of enhancing methodological training for researchers, developing more applicable guidelines, and engaging in thorough design planning to enable more effective and optimal integration of quantitative and qualitative approaches in a study.</span></p>",
    "access_right": "open",
    "creators": [
      {
        "name": "Torang Siregar",
        "affiliation": null,
        "orcid": "0009-0006-1416-0461"
      }
    ],
    "related_identifiers": [
      {
        "identifier": "Identifier",
        "relation": "isCitedBy",
        "resource_type": "publication",
        "scheme": "other"
      }
    ],
    "dates": [
      {
        "type": "valid",
        "description": "This study aims to identify the types of mixed methods and evaluate their application in various social and educational research contexts. Mixed methods is a research approach that combines quantitative and qualitative elements within a single study to gain a more comprehensive, complementary, and holistic understanding of phenomena. This study employs a qualitative descriptive approach with systematic literature review as the primary data collection method, in which primary literature sources such as books, academic journals, and relevant research reports are critically analyzed. The results reveal three main mixed methods designs: sequential explanatory (quantitative followed by qualitative to explain findings), sequential exploratory (qualitative followed by quantitative to generalize initial findings), and convergent parallel (both data types are collected and analyzed simultaneously for comparison). Each type has distinct characteristics, design logic, and implementation stages; their selection depends heavily on the research objectives, questions, and focus. Further analysis indicates that applying mixed methods offers significant advantages, particularly in data triangulation, which enables cross-verification of findings. Other strengths include its ability to enrich analytical depth, provide richer context for statistical data, and enhance the overall validity and reliability of research outcomes. However, despite its strengths, the challenges in implementing this method cannot be overlooked. These challenges encompass greater demands on time, cost, and resources, as well as the need for researcher expertise in mastering and managing two different research paradigms simultaneously. Therefore, this study recommends the importance of enhancing methodological training for researchers, developing more applicable guidelines, and engaging in thorough design planning to enable more effective and optimal integration of quantitative and qualitative approaches in a study."
      }
    ],
    "references": [
      "Akerblad, L., Seppänen-Järvelä, R., & Haapakoski, K. (2021). Integrative strategies in mixed methods research. Journal of Mixed Methods Research, *15*(2), 152-170. https://doi.org/10.1177/1558689820976466 Alexander, V. D., Thomas, H., Cronin, A., Fielding, J., & Moran-Ellis, J. (2008). Mixed methods. Researching social life, 3, 125-144. Almeida, F. (2018). Strategies to perform a mixed methods study. European Journal of Education Studies. Amir, A., Adinda, A., Sutan, T., Siregar, T., & Hariyani, N. (2024). Development of Discrete Mathematics Module Based on Discovery Learning for Mathematical Understanding in Higher Education. Jurnal Kependidikan: Jurnal Hasil Penelitian dan Kajian Kepustakaan di Bidang Pendidikan, Pengajaran, dan Pembelajaran, 10(1), 376-391. Azorín, J. M., & Cameron, R. (2010). The application of mixed methods in organisational research: A literature review. Electronic journal of business research methods, 8(2), pp95-105. Byrne, J., & Humble, Á. M. (2007). An introduction to mixed method research. Atlantic research centre for family-work issues, 1, 1-4. Catalyst, H. (2021). Getting started with mixed methods research. Harvard University. Diakses dari https://catalyst.harvard.edu/wp-content/uploads/2021/03/CEP-Website_MMR-2-Pager.pdf Clark, V. L. P., & Creswell, J. W. (2008). The mixed methods reader. Sage. Creamer, E. G. (2017). An introduction to fully integrated mixed methods research. SAGE Publications. Creswell, J. W. (1999). Mixed-method research: Introduction and application. In Handbook of educational policy (pp. 455-472). Academic press. Creswell, J. W. (2021). A concise introduction to mixed methods research. SAGE Publications. Creswell, J. W., & Clark, V. L. P. (2017). Designing and conducting mixed methods research (3rd ed.). SAGE Publications. Creswell, J. W., & Creswell, J. D. (2017). Research design: Qualitative, quantitative, and mixed methods approaches (5th ed.). SAGE Publications. Creswell, J. W., & Tashakkori, A. (2007). Developing publishable mixed methods manuscripts. Journal of mixed methods research, 1(2), 107-111. Creswell, J. W., Klassen, A. C., Plano Clark, V. L., & Smith, K. C. (2011). Best practices for mixed methods research in the health sciences. National Institutes of Health. Denscombe, M. (2008). Communities of practice: A research paradigm for the mixed methods approach. Journal of Mixed Methods Research, *2*(3), 270-283. https://doi.org/10.1177/1558689808316807 Doyle, L., Brady, A. M., & Byrne, G. (2009). An overview of mixed methods research. Journal of research in nursing, 14(2), 175-185. Doyle, L., Brady, A.-M., & Byrne, G. (2016). An overview of mixed methods research-revisited. Journal of Research in Nursing, *21*(8), 623-635. https://doi.org/10.1177/1744987116673023 Greene, J. C. (2007). Mixed methods in social inquiry. John Wiley & Sons. Greene, J. C. (2008). Is mixed methods social inquiry a distinctive methodology?. Journal of mixed methods research, 2(1), 7-22. Greene, J. C., Caracelli, V. J., & Graham, W. F. (1989). Toward a conceptual framework for mixed-method evaluation designs. Educational evaluation and policy analysis, 11(3), 255-274. Hall, R. (2013). Mixed methods: In search of a paradigm. Conducting research in a changing and challenging world, 71-78. Hansen, M., O'Brien, K., Meckler, G., Chang, A. M., & Guise, J.-M. (2016). Understanding the value of mixed methods research: the Children's Safety Initiative-Emergency Medical Services. Emergency Medicine Journal, *33*(7), 489-494. https://doi.org/10.1136/emermed-2015-204799 Hoy, W. K., & Yam, J. (2021). Business Research: Data Quality & GIGO Trap. Academia Letters, *2*. https://doi.org/10.20935/AL352 Ivankova, N. V., & Creswell, J. W. (2009). Mixed methods. Qualitative research in applied linguistics: A practical introduction, 23, 135-161. Johnson, R. B. (2012). Dialectical pluralism and mixed research. American Behavioral Scientist, *56*(6), 751-754. https://doi.org/10.1177/0002764211433801 Johnson, R. B., & Onwuegbuzie, A. J. (2004). Mixed methods research: A research paradigm whose time has come. Educational Researcher, *33*(7), 14-26. https://doi.org/10.3102/0013189X033007014 Lall, D. (2021). Mixed-methods research: Why, when and how to use. Indian Journal of Continuing Nursing Education, *22*(2), 143-147. Leech, N. L., & Onwuegbuzie, A. J. (2009). A typology of mixed methods research designs. Quality & Quantity, *43*, 265-275. https://doi.org/10.1007/s11135-007-9105-3 Lisa, D., Nasution, M., Siregar, T., Harahap, A., Zainuddin, Z., & Amir, A. (2024). Penggunaan Permainan Edukatif: Suit Perkalian dalam Pembelajaran Matematika. CENDEKIA: Jurnal Penelitian dan Pengkajian Ilmiah, 1(1), 39-46. Malina, M. A., Nørreklit, H. S. O., & Selto, F. H. (2011). Lessons learned: Advantages and disadvantages of mixed method research. Qualitative Research in Accounting & Management, *8*(1), 59-71. https://doi.org/10.1108/11766091111124702 Malina, M. A., Nørreklit, H. S., & Selto, F. H. (2011). Lessons learned: advantages and disadvantages of mixed method research. Qualitative Research in Accounting & Management, 8(1), 59-71. Mason, J. (2006). Mixing methods in a qualitatively driven way. Qualitative research, 6(1), 9-25. Maxwell, J. A., & Loomis, D. M. (2003). Mixed methods design: An alternative approach. Handbook of mixed methods in social and behavioral research, 1(2003), 241-272. Migiro, S. O., & Magangi, B. A. (2011). Mixed methods: A review of literature and the future of the new research paradigm. African journal of business management, 5(10), 3757-3764. Morse, J. M. (2016). Mixed method design: Principles and procedures. Routledge. O'Cathain, A., Murphy, E., & Nicholl, J. (2010). Three techniques for integrating data in mixed methods studies. Bmj, 341. Regnault, A., Willgoss, T., Barbic, S., & the ISOQOL Mixed Methods Special Interest Group. (2018). Towards the use of mixed methods inquiry as best practice in health outcomes research. Journal of Patient-Reported Outcomes, *2*(1), 19. https://doi.org/10.1186/s41687-018-0043-8 Shorten, A., & Smith, J. (2017). Mixed methods research: Expanding the evidence base. Evidence-Based Nursing, *20*(3), 74-75. https://doi.org/10.1136/eb-2017-102699 Siregar, T. (2022). 21st Century Skills and Competencies: The Digital Competence of Future Educators. Siregar, T. (2022). Efforts to Improve Motivation and Learning Outcomes with the Use of Powerpoint Media. Jurnal Ar Ro'is Mandalika (Armada), 2(2), 86-99. Siregar, T. (2023). A Penerapan Model Pembelajaran Problem-Based Learning Untuk Meningkatkan Prestasi Belajar Matematika Siswa Di SMA Negeri 1 Sinunukan. COMPETITIVE: Journal of Education, 2(2), 94-102. Siregar, T. (2023). Pengaruh Minat dan Kreativitas Belajar terhadap Prestasi Matematika Mahasiswa pada Mata Kuliah Kalkulus. Journal of Matematics In Teaching and Learning, 1(2), 32-42. Siregar, T. (2023). Pengaruh Model Problem Based Learning Berbantuan Lkpd Digital Terhadap Kemampuan Pemecahan Asalah Matematis Siswa Pada Materi Statistika. Jurnal Pendidikan Educandum, 3(1), 52-86. Siregar, T. (2023). Stages of research and development model research and development (R&D). DIROSAT: Journal of Education, Social Sciences & Humanities, 1(4), 142-158. Siregar, T. (2023). Tahapan Model Penelitian Dan Pengembangan Research And Development (R&D). DIROSAT: Journal of Education, Social Sciences & Humanities, 1(4), 142-158. Siregar, T. (2024). Aplikasi model pembelajaran inkuiri untuk meningkatkan kemampuan berpikir kreatif mahasiswa dalam belajar matematika. Indonesian Research Journal on Education, 4(1), 82-87. Siregar, T. (2024). Application of Class Supervision to Improve Professional Competency of Teachers at SMP Negeri 1 Padangsidimpuan. Jurnal Intelek Insan Cendikia, 1(2), 100-129. Siregar, T. (2024). Application of Problem Based Learning to Improve Student Motivation and Learning Outcomes on Vector Material. Cigarskruie: Journal of Educational and Islamic Research, 1(2), 99-130. Siregar, T. (2024). Application of the Think Pair Share Learning Model to Improve Recount Text Reading Skills in Class X-1 SMAN 1 Padangsidimpuan. Jurnal Intelek Dan Cendikiawan Nusantara, 1(2), 854-877. Siregar, T. (2024). Implementasi Pembelajaran Door-to-Door dan Luring Bergiliran dalam Pembelajaran Matematika Siswa Sekolah Dasar pada Masa Pandemi Covid-19. Journal of Matematics In Teaching and Learning, 2(2), 156-167. Siregar, T. (2024). Keterampilan dan Kecakapan Abad 21: Kompetensi Digital Pendidik Masadepan. Journal of Islamic and Scientific Education Research, 1(2), 1-11. Siregar, T. (2024). Penerapan Model Pembelajaran Think Pair Share untuk Meningkatkan Keterampilan Membaca Teks Recount di Kelas X-1 SMAN 1 Padangsidimpuan. Indonesian Research Journal on Education, 4(1), 118-126. Siregar, T. (2024). Pengembangan perangkat pembelajaran berbasis blended learning dengan memanfaatkan google classroom pada materi trigonometri di Kelas X SMA Negeri 2 Padangsidimpuan. Jurnal Intelek Dan Cendikiawan Nusantara, 1(2), 819-853. Siregar, T. (2024). Pendidikan Matematika Realistik (PMR) pada Abad 21. Penerbit Adab. Siregar, T. (2025). A Meta-Analysis of Student Learning Outcomes in Indonesia: STEAM Integration and Mathematical Problem Solving. Preprint. https://doi.org/10.20944/preprints202510,1252,v1. Siregar, T. (2025). An Analysis of Lecturers' Pedagogical Practices: Balancing Higher‐and Lower‐Order Thinking Skills in Higher Education. Preprint. https://doi.org/10.20944/preprints202510,1231,v1. Siregar, T. (2025). Analysis of mathematical literacy skills through the Think-Talk-Write (TTW) model assisted by GeoGebra in terms of students' self-efficacy. Siregar, T. (2025). Application of GeoGebra for teaching mathematics. Preprint. https://doi.org/10.20944/preprints202510,648,v1. Siregar, T. (2025). Application of the Peer Tutoring Method in Enhancing Students' Mathematical Understanding and Learning Motivation. Siregar, T. (2025). Application of the STAD (Student Teams Achievement Divisions) learning model in improving mathematics learning activities and achievements. Available at SSRN 5484426. Siregar, T. (2025). Balancing Higher-and Lower-Order Thinking Skills: An Analysis of Lecturers' Pedagogical Practices in Higher Education. Available at SSRN 5590290. Siregar, T. (2025). Classroom Action Research-Based Learning Innovations: Kemmis and McTaggart Models. Siregar, T. (2025). Developing a GeoGebra-Based Mathematics Learning Media Using the Van Hiele Theory Approach to Enhance Students' Understanding of Maximum and Minimum Value. Siregar, T. (2025). Development of artificial intelligence (AI)-based mathematics learning media in calculus courses using the GeoGebra application with the PjBL learning model. Available at SSRN 5577752. Siregar, T. (2025). Effectiveness of the Problem-Based Learning Model in Improving Students' Mathematical Communication Skills and Learning Motivation. Siregar, T. (2025). Enhancing Statistical Learning and Problem Solving through the Use of GeoGebra. Siregar, T. (2025). Examining the Dimensions of Mathematical Knowledge for Teaching among Preservice Elementary Teachers. Siregar, T. (2025). Integrating GeoGebra in mathematics education: Enhancing pedagogical practices among teachers and lecturers. Yerizon, Integrating GeoGebra in Mathematics Education: Enhancing Pedagogical Practices among Teachers and Lecturers (October 16, 2025). Siregar, T. (2025). Literature review: The use of GeoGebra software on mathematical comprehension ability. Preprint. https://doi.org/10.20944/preprints202510,925,v1. Siregar, T. (2025). Mengapa Validitas dan Reliabilitas Penting dalam L&D (Pembelajaran & Pengembangan): Apa yang Dapat Anda Lakukan Tentang Hal Ini. JURNAL PEMIKIRAN DAN PENGEMBANGAN PEMBELAJARAN, 7(1), 1-12. Siregar, T. (2025). Pengembangan Media Pembelajaran Quiz Matematika Interaktif Berbasis Web Untuk Meningkatkan Kemampuan Pemecahan Masalah Siswa Kelas X SMA Negeri 1 Sinunukan. Jurnal Teknologi Pendidikan dan Desain Media Pembelajaran ISSN: XXXX-XXXX, 1(1), 9-16. Siregar, T. (2025). PERBANDINGAN PENDIDIKAN MESIR INDONESIA. Dialektika Publik, 9(1), 36-55. Siregar, T. (2025). Practicality and Effectiveness of Online-Based Calculus Learning Materials Assisted by GeoGebra. Siregar, T. (2025). STEAM integration and mathematical problem solving: A meta-analysis of student learning outcomes in Indonesia. Preprint. https://doi.org/10.20944/preprints202510,1219,v1. Siregar, T. (2025). Tensions Between Perceptions and Practices Among Teacher Educators in Implementing Intellectual Virtues Pedagogy. Siregar, T. (2025). THE EFFECT OF THE USE OF THE ANCHORED INSTRUCTION LEARNING MODEL ON THE IMPROVEMENT OF STUDENTS'MATHEMATICAL COMMUNICATION SKILLS AND SELF-CONCEPT. JOURNAL OF MATHEMATICS EDUCATION, 2(4), 1-20. Siregar, T. (2025). The effectiveness of the discovery learning model in enhancing students' mathematical problem-solving skills. Siregar, T. (2025). The Effectiveness of Using GeoGebra Application with Problem-Based Learning Model on Students' Mathematical Communication Ability. Siregar, T. (2025). The Effects of GeoGebra on Students Achievement. Available at SSRN 5577731. Siregar, T. (2025). Virtual reality (VR) based learning media as a support of mathematics learning process for students in schools. Available at SSRN 5577735. Siregar, T. (2025). Development of GeoGebra-Assisted E-Module in Multiple Integral Calculus Course. Siregar, T. (2025). Improvement of mathematics learning outcomes through the implementation of the realistic mathematics education (RME) approach in primary schools. Zenodo. Siregar, T. (2025). Integrasi etnomatematika dengan kearifan budaya lokal. Goresan Pena. Siregar, T. (2025). MICRO TEACHING. Goresan Pena. Siregar, T. (2025). Stimulus Dan Respon Dalam Pembelajaran Matematika. Goresan Pena. Siregar, T. (2025). Strategy to Enhance Early Mathematics Learning in Early Childhood Education (PAUD). Siregar, T. (2025). Trigonometri. Goresan Pena. Siregar, T. A Study on Developing Students' Abstract Thinking Skills Through Measurable Functions in Advanced Real Analysis. Siregar, T. Research and Development (R&D) Method: Definition, Types, and Stages. Siregar, T., & Ali, D. T. M. U. S. Efektivitas Penggunaan Software Matematika dalam Meningkatkan Pemahaman Mahasiswa terhadap Topik Kontinuitas pada Analisis Real Lanjutan. Siregar, T., & Amir, A. (2023). Upaya Meningkatkan Aktivitas dan Prestasi Belajar Matematika Melalui Penerapan Metode Permainan Di Kelas VI SD Negeri 327 Sinunukan Kecamatan Sinunukan. JURNAL PENDIDIKAN ILMU PENGETAHUAN ALAM, 1(1), 67-74. Siregar, T., & Amir, A. (2024). Efforts to Increase Mathematics Learning Activities and Achievements Through the Application of Game Methods in Class VI of SD Negeri 327 Sinunukan, Sinunukan District. COMPETITIVE: Journal of Education, 3(1), 28-44. Siregar, T., & Amir, A. Application of the Problem-Based Learning (PBL) Model Assisted by Audiovisual Media in Improving the Mathematical Communication Skills of Class VII-B Students at MTs Negeri 1 Padangsidimpuan. SIREGAR, T., & ARDIAN, R. PASCASARJANA TADRIS MATEMATIKA UNIVERSITAS ISLAM NEGERI SYEKH ALI HASAN AHMAD ADDARY PADANGSIDIMPUAN. Siregar, T., & Rahmadhani, S. An Exploration of EFL Teachers' Perceptions of Using Game-Based Learning Tools in Virtual Classes in an Indonesian Primary School Context. Siregar, T., & Rhamayanti, Y. (2025). Implementasi Pengembangan Model ADDIE pada Dunia Pendidikan. Jurnal Hasil Penelitian dan Pengembangan (JHPP), 3(2), 85-100. Siregar, T., & Suparni, R. F. PENGEMBANGAN BUKU AJAR KALKULUS DIFERENSIAL BERBASIS MASALAH DENGAN MODEL PENEMUAN TERBIMBING. Siregar, T., & Suparni, S. S. (2025). ANALISIS RIIL. Goresan Pena. Siregar, T., Abadi, A. M., Andayani, S., Rangkuti, A. N., & Sungkono, J. (2024). Uji Normalitas Gain untuk Pemantapan dan Modul Dengan One Group Pre And Post Test di SMP Negeri 1 Padangsidimpuan. Dedikasi: Jurnal Pengabdian Kepada Masyarakat, 3(2), 499-504. Siregar, T., Amir, A., & Suparni, S. S. (2025). KALKULUS LANJUTAN. Goresan Pena. Siregar, T., Amir, A., Hilda, L., & Adinda, A. (2023). Determining the Surface Area of a Tube Using the Discovery Learning Model at SMP Negeri 5 Sinunukan. COMPETITIVE: Journal of Education, 2(4), 265-275. Siregar, T., Amir, A., Suparni, A. A., & Nasution, M. Analysis of the Influence of Interest and Talent on the Mathematics Learning Outcomes of Ninth-Grade Students at SMP Negeri 2 Sinunukan. Siregar, T., Ardian, R., Harahap, S. R., & Nasution, A. A. (2024). Media Pembelajaran Berbasis Ict Menggunakan Software Scratchpada Materi Peluang Di Smpn 2 Portibi. SINERGI: Jurnal Riset Ilmiah, 1(1), 6-14. Siregar, T., Arisman, A., Ardian, R., & Harahap, A. (2023). Research And Developing Mathematics Knowledge Child Development Perspectives, 2022. Elementaria: Journal of Educational Research, 1(2), 65-76. Siregar, T., Fauzan, A., Yerizon, Y., & Syafriandi, S. (2025). Designing Mathematics Teaching through Deep Learning Pedagogy: Toward Meaningful, Mindful, and Joyful Learning. Journal of Deep Learning, 188-202. Siregar, T., Harahap, A., Arisman, A., Rangkuti, H. H., Harahap, I. S., Ardian, R., ... & Batubara, Z. (2023). What Makes it Special?: Content Knowledge for Teaching. International Journal of Applied, 1(1), 21-40. Siregar, T., Hariadi, J., & Effendi, D. I. (2020). Analisis Presuposisi Pada Percakapan Siswakelas Xi Jurusan Tata Busana Smk Negeri 3 Langsa Tahun 2019. Jurnal Samudra Bahasa, 3(1), 1-5. Siregar, T., Hilda, L., Amir, A., Syekh, U., & Hasan, A. (2024). Evaluasi dalam Meningkatkan Kemampuan Pemecahan Masalah Matematika Mahasiswa melalui Penggunaan Metode Tugas Berbasis Proyek di UIN Syahada Padangsidimpuan Evaluasi dalam Meningkatkan Kemampuan Pemecahan Masalah Matematika Mahasiswa melalui Penggunaan Met. Siregar, T., Improve Students' Critical Thinking Skills About Energy and Its Use Through the Society Technology Science Learning Model https://doi.org/10.59613/armada.v1i3.2850 Siregar, T., Marsigit, A., Rosnawati, K., Hidayati, K., & Wustqa, D. U. (2023). Penerapan Problem Based Learning Untuk Meningkatkan Motivasi dan Hasil Belajar Siswa Pada Materi Vektor. Siregar, T., Rangkuti, A. N., Harahap, S. D., Nasution, E. S., & Siregar, I. M. Increasing Interest and Achievement in Learning Mathematics Through Problem-Based Learning Methods for Class VIIA Students at SMPN 1 Padangsidimpuan Meningkatkan Minat Dan Prestasi Belajar Matematika Melalui Metode Pembelajaran Berbasis Masalah Pesertadidik Kelas VIIA SMPN. Siregar, T., Rangkuti, A. N., Hilda, L., & Harahap, S. D. (2024). UPAYA MENINGKATKAN PRESTASI BELAJAR SISWA PADA PENJUMLAHAN DAN PENGURANGAN PECAHAN MELALUI MODEL PEMBELAJARAN CONTEXTUAL TEACHING AND LEARNING (CTL) DI KELAS V SD 01 KOTA PADANGSIDIMPUAN. Jurnal Pendekar Nusantara, 1(2). Siregar, T., Sugiman, S., Jailani, J., Adinda, A., & Amir, A. (2025). Implementasi Pendekatan Kontekstual Untuk Meningkatkan Prestasi Belajar Matematika Siswa Kelas V SDN 327 Sinunukan. Dedikasi : Jurnal Pengabdian Kepada Masyarakat, 4(1), 1–14. https://doi.org/10.53276/dedikasi.v4i1.207 Siregar, T., Suparni, L. H., Amir, A., & Nasution, M. Challenge Based on Differentiated Learning: Efforts to Develop Numeracy Literacy and Facilitate Student Learning Needs. Siregar, T., Wibowo, A., Permadhani, S., & Marlina, E. Educational Innovation for a Brighter Future in the World. Siregar, Torang, Application of the STAD (Student Teams Achievement Divisions) Learning Model in Improving Mathematics Learning Activities and Achievements (September 14, 2025). Available at SSRN: https://ssrn.com/abstract=5484426 or http://dx.doi.org/10.2139/ssrn.5484426 Tashakkori, A., & Creswell, J. W. (2007). The new era of mixed methods. Journal of mixed methods research, 1(1), 3-7. Tashakkori, A., & Teddlie, C. (Eds.). (2010). SAGE handbook of mixed methods in social & behavioral research (2nd ed.). SAGE Publications. Torang Siregar, & Amir, A. (2024). The Effect of Realistic Mathematics Education to Overcome Students' Mathematical Misconceptions about Fractions in SDN 327 Sinunukan. Journal of Matematics In Teaching and Learning, 3(1), 243–250. Retrieved from https://jurnal.stain-madina.ac.id/index.php/matematika/article/view/1416 Torang Siregar. (2024). Implementasi Pembelajaran Door-to-Door dan Luring Bergiliran dalam Pembelajaran Matematika Siswa Sekolah Dasar pada Masa Pandemi Covid-19. Journal of Matematics In Teaching and Learning, 2(2), 156–167. Retrieved from https://jurnal.stain-madina.ac.id/index.php/matematika/article/view/1417 Warfa, A.-R. M. (2016). Mixed-methods design in biology education research: Approach and uses. CBE—Life Sciences Education, *15*(4), rm5. https://doi.org/10.1187/cbe.16-01-0068 Wilkinson, I. A. G., & Staley, B. (2019). On the pitfalls and promises of using mixed methods in literacy research: Perceptions of reviewers. Research Papers in Education, *34*(1), 61-83. https://doi.org/10.1080/02671522.2017.1402081",
      "Akerblad, L., Seppänen-Järvelä, R., & Haapakoski, K. (2021). Integrative strategies in mixed methods research. Journal of Mixed Methods Research, *15*(2), 152-170. https://doi.org/10.1177/1558689820976466 Alexander, V. D., Thomas, H., Cronin, A., Fielding, J., & Moran-Ellis, J. (2008). Mixed methods. Researching social life, 3, 125-144. Almeida, F. (2018). Strategies to perform a mixed methods study. European Journal of Education Studies. Amir, A., Adinda, A., Sutan, T., Siregar, T., & Hariyani, N. (2024). Development of Discrete Mathematics Module Based on Discovery Learning for Mathematical Understanding in Higher Education. Jurnal Kependidikan: Jurnal Hasil Penelitian dan Kajian Kepustakaan di Bidang Pendidikan, Pengajaran, dan Pembelajaran, 10(1), 376-391. Azorín, J. M., & Cameron, R. (2010). The application of mixed methods in organisational research: A literature review. Electronic journal of business research methods, 8(2), pp95-105. Byrne, J., & Humble, Á. M. (2007). An introduction to mixed method research. Atlantic research centre for family-work issues, 1, 1-4. Catalyst, H. (2021). Getting started with mixed methods research. Harvard University. Diakses dari https://catalyst.harvard.edu/wp-content/uploads/2021/03/CEP-Website_MMR-2-Pager.pdf Clark, V. L. P., & Creswell, J. W. (2008). The mixed methods reader. Sage. Creamer, E. G. (2017). An introduction to fully integrated mixed methods research. SAGE Publications. Creswell, J. W. (1999). Mixed-method research: Introduction and application. In Handbook of educational policy (pp. 455-472). Academic press. Creswell, J. W. (2021). A concise introduction to mixed methods research. SAGE Publications. Creswell, J. W., & Clark, V. L. P. (2017). Designing and conducting mixed methods research (3rd ed.). SAGE Publications. Creswell, J. W., & Creswell, J. D. (2017). Research design: Qualitative, quantitative, and mixed methods approaches (5th ed.). SAGE Publications. Creswell, J. W., & Tashakkori, A. (2007). Developing publishable mixed methods manuscripts. Journal of mixed methods research, 1(2), 107-111. Creswell, J. W., Klassen, A. C., Plano Clark, V. L., & Smith, K. C. (2011). Best practices for mixed methods research in the health sciences. National Institutes of Health. Denscombe, M. (2008). Communities of practice: A research paradigm for the mixed methods approach. Journal of Mixed Methods Research, *2*(3), 270-283. https://doi.org/10.1177/1558689808316807 Doyle, L., Brady, A. M., & Byrne, G. (2009). An overview of mixed methods research. Journal of research in nursing, 14(2), 175-185. Doyle, L., Brady, A.-M., & Byrne, G. (2016). An overview of mixed methods research-revisited. Journal of Research in Nursing, *21*(8), 623-635. https://doi.org/10.1177/1744987116673023 Greene, J. C. (2007). Mixed methods in social inquiry. John Wiley & Sons. Greene, J. C. (2008). Is mixed methods social inquiry a distinctive methodology?. Journal of mixed methods research, 2(1), 7-22. Greene, J. C., Caracelli, V. J., & Graham, W. F. (1989). Toward a conceptual framework for mixed-method evaluation designs. Educational evaluation and policy analysis, 11(3), 255-274. Hall, R. (2013). Mixed methods: In search of a paradigm. Conducting research in a changing and challenging world, 71-78. Hansen, M., O'Brien, K., Meckler, G., Chang, A. M., & Guise, J.-M. (2016). Understanding the value of mixed methods research: the Children's Safety Initiative-Emergency Medical Services. Emergency Medicine Journal, *33*(7), 489-494. https://doi.org/10.1136/emermed-2015-204799 Hoy, W. K., & Yam, J. (2021). Business Research: Data Quality & GIGO Trap. Academia Letters, *2*. https://doi.org/10.20935/AL352 Ivankova, N. V., & Creswell, J. W. (2009). Mixed methods. Qualitative research in applied linguistics: A practical introduction, 23, 135-161. Johnson, R. B. (2012). Dialectical pluralism and mixed research. American Behavioral Scientist, *56*(6), 751-754. https://doi.org/10.1177/0002764211433801 Johnson, R. B., & Onwuegbuzie, A. J. (2004). Mixed methods research: A research paradigm whose time has come. Educational Researcher, *33*(7), 14-26. https://doi.org/10.3102/0013189X033007014 Lall, D. (2021). Mixed-methods research: Why, when and how to use. Indian Journal of Continuing Nursing Education, *22*(2), 143-147. Leech, N. L., & Onwuegbuzie, A. J. (2009). A typology of mixed methods research designs. Quality & Quantity, *43*, 265-275. https://doi.org/10.1007/s11135-007-9105-3 Lisa, D., Nasution, M., Siregar, T., Harahap, A., Zainuddin, Z., & Amir, A. (2024). Penggunaan Permainan Edukatif: Suit Perkalian dalam Pembelajaran Matematika. CENDEKIA: Jurnal Penelitian dan Pengkajian Ilmiah, 1(1), 39-46. Malina, M. A., Nørreklit, H. S. O., & Selto, F. H. (2011). Lessons learned: Advantages and disadvantages of mixed method research. Qualitative Research in Accounting & Management, *8*(1), 59-71. https://doi.org/10.1108/11766091111124702 Malina, M. A., Nørreklit, H. S., & Selto, F. H. (2011). Lessons learned: advantages and disadvantages of mixed method research. Qualitative Research in Accounting & Management, 8(1), 59-71. Mason, J. (2006). Mixing methods in a qualitatively driven way. Qualitative research, 6(1), 9-25. Maxwell, J. A., & Loomis, D. M. (2003). Mixed methods design: An alternative approach. Handbook of mixed methods in social and behavioral research, 1(2003), 241-272. Migiro, S. O., & Magangi, B. A. (2011). Mixed methods: A review of literature and the future of the new research paradigm. African journal of business management, 5(10), 3757-3764. Morse, J. M. (2016). Mixed method design: Principles and procedures. Routledge. O'Cathain, A., Murphy, E., & Nicholl, J. (2010). Three techniques for integrating data in mixed methods studies. Bmj, 341. Regnault, A., Willgoss, T., Barbic, S., & the ISOQOL Mixed Methods Special Interest Group. (2018). Towards the use of mixed methods inquiry as best practice in health outcomes research. Journal of Patient-Reported Outcomes, *2*(1), 19. https://doi.org/10.1186/s41687-018-0043-8 Shorten, A., & Smith, J. (2017). Mixed methods research: Expanding the evidence base. Evidence-Based Nursing, *20*(3), 74-75. https://doi.org/10.1136/eb-2017-102699 Siregar, T. (2022). 21st Century Skills and Competencies: The Digital Competence of Future Educators. Siregar, T. (2022). Efforts to Improve Motivation and Learning Outcomes with the Use of Powerpoint Media. Jurnal Ar Ro'is Mandalika (Armada), 2(2), 86-99. Siregar, T. (2023). A Penerapan Model Pembelajaran Problem-Based Learning Untuk Meningkatkan Prestasi Belajar Matematika Siswa Di SMA Negeri 1 Sinunukan. COMPETITIVE: Journal of Education, 2(2), 94-102. Siregar, T. (2023). Pengaruh Minat dan Kreativitas Belajar terhadap Prestasi Matematika Mahasiswa pada Mata Kuliah Kalkulus. Journal of Matematics In Teaching and Learning, 1(2), 32-42. Siregar, T. (2023). Pengaruh Model Problem Based Learning Berbantuan Lkpd Digital Terhadap Kemampuan Pemecahan Asalah Matematis Siswa Pada Materi Statistika. Jurnal Pendidikan Educandum, 3(1), 52-86. Siregar, T. (2023). Stages of research and development model research and development (R&D). DIROSAT: Journal of Education, Social Sciences & Humanities, 1(4), 142-158. Siregar, T. (2023). Tahapan Model Penelitian Dan Pengembangan Research And Development (R&D). DIROSAT: Journal of Education, Social Sciences & Humanities, 1(4), 142-158. Siregar, T. (2024). Aplikasi model pembelajaran inkuiri untuk meningkatkan kemampuan berpikir kreatif mahasiswa dalam belajar matematika. Indonesian Research Journal on Education, 4(1), 82-87. Siregar, T. (2024). Application of Class Supervision to Improve Professional Competency of Teachers at SMP Negeri 1 Padangsidimpuan. Jurnal Intelek Insan Cendikia, 1(2), 100-129. Siregar, T. (2024). Application of Problem Based Learning to Improve Student Motivation and Learning Outcomes on Vector Material. Cigarskruie: Journal of Educational and Islamic Research, 1(2), 99-130. Siregar, T. (2024). Application of the Think Pair Share Learning Model to Improve Recount Text Reading Skills in Class X-1 SMAN 1 Padangsidimpuan. Jurnal Intelek Dan Cendikiawan Nusantara, 1(2), 854-877. Siregar, T. (2024). Implementasi Pembelajaran Door-to-Door dan Luring Bergiliran dalam Pembelajaran Matematika Siswa Sekolah Dasar pada Masa Pandemi Covid-19. Journal of Matematics In Teaching and Learning, 2(2), 156-167. Siregar, T. (2024). Keterampilan dan Kecakapan Abad 21: Kompetensi Digital Pendidik Masadepan. Journal of Islamic and Scientific Education Research, 1(2), 1-11. Siregar, T. (2024). Penerapan Model Pembelajaran Think Pair Share untuk Meningkatkan Keterampilan Membaca Teks Recount di Kelas X-1 SMAN 1 Padangsidimpuan. Indonesian Research Journal on Education, 4(1), 118-126. Siregar, T. (2024). Pengembangan perangkat pembelajaran berbasis blended learning dengan memanfaatkan google classroom pada materi trigonometri di Kelas X SMA Negeri 2 Padangsidimpuan. Jurnal Intelek Dan Cendikiawan Nusantara, 1(2), 819-853. Siregar, T. (2024). Pendidikan Matematika Realistik (PMR) pada Abad 21. Penerbit Adab. Siregar, T. (2025). A Meta-Analysis of Student Learning Outcomes in Indonesia: STEAM Integration and Mathematical Problem Solving. Preprint. https://doi.org/10.20944/preprints202510,1252,v1. Siregar, T. (2025). An Analysis of Lecturers' Pedagogical Practices: Balancing Higher‐and Lower‐Order Thinking Skills in Higher Education. Preprint. https://doi.org/10.20944/preprints202510,1231,v1. Siregar, T. (2025). Analysis of mathematical literacy skills through the Think-Talk-Write (TTW) model assisted by GeoGebra in terms of students' self-efficacy. Siregar, T. (2025). Application of GeoGebra for teaching mathematics. Preprint. https://doi.org/10.20944/preprints202510,648,v1. Siregar, T. (2025). Application of the Peer Tutoring Method in Enhancing Students' Mathematical Understanding and Learning Motivation. Siregar, T. (2025). Application of the STAD (Student Teams Achievement Divisions) learning model in improving mathematics learning activities and achievements. Available at SSRN 5484426. Siregar, T. (2025). Balancing Higher-and Lower-Order Thinking Skills: An Analysis of Lecturers' Pedagogical Practices in Higher Education. Available at SSRN 5590290. Siregar, T. (2025). Classroom Action Research-Based Learning Innovations: Kemmis and McTaggart Models. Siregar, T. (2025). Developing a GeoGebra-Based Mathematics Learning Media Using the Van Hiele Theory Approach to Enhance Students' Understanding of Maximum and Minimum Value. Siregar, T. (2025). Development of artificial intelligence (AI)-based mathematics learning media in calculus courses using the GeoGebra application with the PjBL learning model. Available at SSRN 5577752. Siregar, T. (2025). Effectiveness of the Problem-Based Learning Model in Improving Students' Mathematical Communication Skills and Learning Motivation. Siregar, T. (2025). Enhancing Statistical Learning and Problem Solving through the Use of GeoGebra. Siregar, T. (2025). Examining the Dimensions of Mathematical Knowledge for Teaching among Preservice Elementary Teachers. Siregar, T. (2025). Integrating GeoGebra in mathematics education: Enhancing pedagogical practices among teachers and lecturers. Yerizon, Integrating GeoGebra in Mathematics Education: Enhancing Pedagogical Practices among Teachers and Lecturers (October 16, 2025). Siregar, T. (2025). Literature review: The use of GeoGebra software on mathematical comprehension ability. Preprint. https://doi.org/10.20944/preprints202510,925,v1. Siregar, T. (2025). Mengapa Validitas dan Reliabilitas Penting dalam L&D (Pembelajaran & Pengembangan): Apa yang Dapat Anda Lakukan Tentang Hal Ini. JURNAL PEMIKIRAN DAN PENGEMBANGAN PEMBELAJARAN, 7(1), 1-12. Siregar, T. (2025). Pengembangan Media Pembelajaran Quiz Matematika Interaktif Berbasis Web Untuk Meningkatkan Kemampuan Pemecahan Masalah Siswa Kelas X SMA Negeri 1 Sinunukan. Jurnal Teknologi Pendidikan dan Desain Media Pembelajaran ISSN: XXXX-XXXX, 1(1), 9-16. Siregar, T. (2025). PERBANDINGAN PENDIDIKAN MESIR INDONESIA. Dialektika Publik, 9(1), 36-55. Siregar, T. (2025). Practicality and Effectiveness of Online-Based Calculus Learning Materials Assisted by GeoGebra. Siregar, T. (2025). STEAM integration and mathematical problem solving: A meta-analysis of student learning outcomes in Indonesia. Preprint. https://doi.org/10.20944/preprints202510,1219,v1. Siregar, T. (2025). Tensions Between Perceptions and Practices Among Teacher Educators in Implementing Intellectual Virtues Pedagogy. Siregar, T. (2025). THE EFFECT OF THE USE OF THE ANCHORED INSTRUCTION LEARNING MODEL ON THE IMPROVEMENT OF STUDENTS'MATHEMATICAL COMMUNICATION SKILLS AND SELF-CONCEPT. JOURNAL OF MATHEMATICS EDUCATION, 2(4), 1-20. Siregar, T. (2025). The effectiveness of the discovery learning model in enhancing students' mathematical problem-solving skills. Siregar, T. (2025). The Effectiveness of Using GeoGebra Application with Problem-Based Learning Model on Students' Mathematical Communication Ability. Siregar, T. (2025). The Effects of GeoGebra on Students Achievement. Available at SSRN 5577731. Siregar, T. (2025). Virtual reality (VR) based learning media as a support of mathematics learning process for students in schools. Available at SSRN 5577735. Siregar, T. (2025). Development of GeoGebra-Assisted E-Module in Multiple Integral Calculus Course. Siregar, T. (2025). Improvement of mathematics learning outcomes through the implementation of the realistic mathematics education (RME) approach in primary schools. Zenodo. Siregar, T. (2025). Integrasi etnomatematika dengan kearifan budaya lokal. Goresan Pena. Siregar, T. (2025). MICRO TEACHING. Goresan Pena. Siregar, T. (2025). Stimulus Dan Respon Dalam Pembelajaran Matematika. Goresan Pena. Siregar, T. (2025). Strategy to Enhance Early Mathematics Learning in Early Childhood Education (PAUD). Siregar, T. (2025). Trigonometri. Goresan Pena. Siregar, T. A Study on Developing Students' Abstract Thinking Skills Through Measurable Functions in Advanced Real Analysis. Siregar, T. Research and Development (R&D) Method: Definition, Types, and Stages. Siregar, T., & Ali, D. T. M. U. S. Efektivitas Penggunaan Software Matematika dalam Meningkatkan Pemahaman Mahasiswa terhadap Topik Kontinuitas pada Analisis Real Lanjutan. Siregar, T., & Amir, A. (2023). Upaya Meningkatkan Aktivitas dan Prestasi Belajar Matematika Melalui Penerapan Metode Permainan Di Kelas VI SD Negeri 327 Sinunukan Kecamatan Sinunukan. JURNAL PENDIDIKAN ILMU PENGETAHUAN ALAM, 1(1), 67-74. Siregar, T., & Amir, A. (2024). Efforts to Increase Mathematics Learning Activities and Achievements Through the Application of Game Methods in Class VI of SD Negeri 327 Sinunukan, Sinunukan District. COMPETITIVE: Journal of Education, 3(1), 28-44. Siregar, T., & Amir, A. Application of the Problem-Based Learning (PBL) Model Assisted by Audiovisual Media in Improving the Mathematical Communication Skills of Class VII-B Students at MTs Negeri 1 Padangsidimpuan. SIREGAR, T., & ARDIAN, R. PASCASARJANA TADRIS MATEMATIKA UNIVERSITAS ISLAM NEGERI SYEKH ALI HASAN AHMAD ADDARY PADANGSIDIMPUAN. Siregar, T., & Rahmadhani, S. An Exploration of EFL Teachers' Perceptions of Using Game-Based Learning Tools in Virtual Classes in an Indonesian Primary School Context. Siregar, T., & Rhamayanti, Y. (2025). Implementasi Pengembangan Model ADDIE pada Dunia Pendidikan. Jurnal Hasil Penelitian dan Pengembangan (JHPP), 3(2), 85-100. Siregar, T., & Suparni, R. F. PENGEMBANGAN BUKU AJAR KALKULUS DIFERENSIAL BERBASIS MASALAH DENGAN MODEL PENEMUAN TERBIMBING. Siregar, T., & Suparni, S. S. (2025). ANALISIS RIIL. Goresan Pena. Siregar, T., Abadi, A. M., Andayani, S., Rangkuti, A. N., & Sungkono, J. (2024). Uji Normalitas Gain untuk Pemantapan dan Modul Dengan One Group Pre And Post Test di SMP Negeri 1 Padangsidimpuan. Dedikasi: Jurnal Pengabdian Kepada Masyarakat, 3(2), 499-504. Siregar, T., Amir, A., & Suparni, S. S. (2025). KALKULUS LANJUTAN. Goresan Pena. Siregar, T., Amir, A., Hilda, L., & Adinda, A. (2023). Determining the Surface Area of a Tube Using the Discovery Learning Model at SMP Negeri 5 Sinunukan. COMPETITIVE: Journal of Education, 2(4), 265-275. Siregar, T., Amir, A., Suparni, A. A., & Nasution, M. Analysis of the Influence of Interest and Talent on the Mathematics Learning Outcomes of Ninth-Grade Students at SMP Negeri 2 Sinunukan. Siregar, T., Ardian, R., Harahap, S. R., & Nasution, A. A. (2024). Media Pembelajaran Berbasis Ict Menggunakan Software Scratchpada Materi Peluang Di Smpn 2 Portibi. SINERGI: Jurnal Riset Ilmiah, 1(1), 6-14. Siregar, T., Arisman, A., Ardian, R., & Harahap, A. (2023). Research And Developing Mathematics Knowledge Child Development Perspectives, 2022. Elementaria: Journal of Educational Research, 1(2), 65-76. Siregar, T., Fauzan, A., Yerizon, Y., & Syafriandi, S. (2025). Designing Mathematics Teaching through Deep Learning Pedagogy: Toward Meaningful, Mindful, and Joyful Learning. Journal of Deep Learning, 188-202. Siregar, T., Harahap, A., Arisman, A., Rangkuti, H. H., Harahap, I. S., Ardian, R., ... & Batubara, Z. (2023). What Makes it Special?: Content Knowledge for Teaching. International Journal of Applied, 1(1), 21-40. Siregar, T., Hariadi, J., & Effendi, D. I. (2020). Analisis Presuposisi Pada Percakapan Siswakelas Xi Jurusan Tata Busana Smk Negeri 3 Langsa Tahun 2019. Jurnal Samudra Bahasa, 3(1), 1-5. Siregar, T., Hilda, L., Amir, A., Syekh, U., & Hasan, A. (2024). Evaluasi dalam Meningkatkan Kemampuan Pemecahan Masalah Matematika Mahasiswa melalui Penggunaan Metode Tugas Berbasis Proyek di UIN Syahada Padangsidimpuan Evaluasi dalam Meningkatkan Kemampuan Pemecahan Masalah Matematika Mahasiswa melalui Penggunaan Met. Siregar, T., Improve Students' Critical Thinking Skills About Energy and Its Use Through the Society Technology Science Learning Model https://doi.org/10.59613/armada.v1i3.2850 Siregar, T., Marsigit, A., Rosnawati, K., Hidayati, K., & Wustqa, D. U. (2023). Penerapan Problem Based Learning Untuk Meningkatkan Motivasi dan Hasil Belajar Siswa Pada Materi Vektor. Siregar, T., Rangkuti, A. N., Harahap, S. D., Nasution, E. S., & Siregar, I. M. Increasing Interest and Achievement in Learning Mathematics Through Problem-Based Learning Methods for Class VIIA Students at SMPN 1 Padangsidimpuan Meningkatkan Minat Dan Prestasi Belajar Matematika Melalui Metode Pembelajaran Berbasis Masalah Pesertadidik Kelas VIIA SMPN. Siregar, T., Rangkuti, A. N., Hilda, L., & Harahap, S. D. (2024). UPAYA MENINGKATKAN PRESTASI BELAJAR SISWA PADA PENJUMLAHAN DAN PENGURANGAN PECAHAN MELALUI MODEL PEMBELAJARAN CONTEXTUAL TEACHING AND LEARNING (CTL) DI KELAS V SD 01 KOTA PADANGSIDIMPUAN. Jurnal Pendekar Nusantara, 1(2). Siregar, T., Sugiman, S., Jailani, J., Adinda, A., & Amir, A. (2025). Implementasi Pendekatan Kontekstual Untuk Meningkatkan Prestasi Belajar Matematika Siswa Kelas V SDN 327 Sinunukan. Dedikasi : Jurnal Pengabdian Kepada Masyarakat, 4(1), 1–14. https://doi.org/10.53276/dedikasi.v4i1.207 Siregar, T., Suparni, L. H., Amir, A., & Nasution, M. Challenge Based on Differentiated Learning: Efforts to Develop Numeracy Literacy and Facilitate Student Learning Needs. Siregar, T., Wibowo, A., Permadhani, S., & Marlina, E. Educational Innovation for a Brighter Future in the World. Siregar, Torang, Application of the STAD (Student Teams Achievement Divisions) Learning Model in Improving Mathematics Learning Activities and Achievements (September 14, 2025). Available at SSRN: https://ssrn.com/abstract=5484426 or http://dx.doi.org/10.2139/ssrn.5484426 Tashakkori, A., & Creswell, J. W. (2007). The new era of mixed methods. Journal of mixed methods research, 1(1), 3-7. Tashakkori, A., & Teddlie, C. (Eds.). (2010). SAGE handbook of mixed methods in social & behavioral research (2nd ed.). SAGE Publications. Torang Siregar, & Amir, A. (2024). The Effect of Realistic Mathematics Education to Overcome Students' Mathematical Misconceptions about Fractions in SDN 327 Sinunukan. Journal of Matematics In Teaching and Learning, 3(1), 243–250. Retrieved from https://jurnal.stain-madina.ac.id/index.php/matematika/article/view/1416 Torang Siregar. (2024). Implementasi Pembelajaran Door-to-Door dan Luring Bergiliran dalam Pembelajaran Matematika Siswa Sekolah Dasar pada Masa Pandemi Covid-19. Journal of Matematics In Teaching and Learning, 2(2), 156–167. Retrieved from https://jurnal.stain-madina.ac.id/index.php/matematika/article/view/1417 Warfa, A.-R. M. (2016). Mixed-methods design in biology education research: Approach and uses. CBE—Life Sciences Education, *15*(4), rm5. https://doi.org/10.1187/cbe.16-01-0068 Wilkinson, I. A. G., & Staley, B. (2019). On the pitfalls and promises of using mixed methods in literacy research: Perceptions of reviewers. Research Papers in Education, *34*(1), 61-83. https://doi.org/10.1080/02671522.2017.1402081"
    ],
    "resource_type": {
      "title": "Journal article",
      "type": "publication",
      "subtype": "article"
    },
    "alternate_identifiers": [
      {
        "identifier": "Identifier"
      }
    ],
    "license": {
      "id": "cc-by-4.0"
    },
    "relations": {
      "version": [
        {
          "index": 0,
          "is_last": true,
          "parent": {
            "pid_type": "recid",
            "pid_value": "17783960"
          }
        }
      ]
    }
  },
  "title": "Mixed Methods Research Approach",
  "links": {
    "self": "https://zenodo.org/api/records/17783961",
    "self_html": "https://zenodo.org/records/17783961",
    "preview_html": "https://zenodo.org/records/17783961?preview=1",
    "doi": "https://doi.org/10.5281/zenodo.17783961",
    "self_doi": "https://doi.org/10.5281/zenodo.17783961",
    "self_doi_html": "https://zenodo.org/doi/10.5281/zenodo.17783961",
    "reserve_doi": "https://zenodo.org/api/records/17783961/draft/pids/doi",
    "parent": "https://zenodo.org/api/records/17783960",
    "parent_html": "https://zenodo.org/records/17783960",
    "parent_doi": "https://doi.org/10.5281/zenodo.17783960",
    "parent_doi_html": "https://zenodo.org/doi/10.5281/zenodo.17783960",
    "self_iiif_manifest": "https://zenodo.org/api/iiif/record:17783961/manifest",
    "self_iiif_sequence": "https://zenodo.org/api/iiif/record:17783961/sequence/default",
    "files": "https://zenodo.org/api/records/17783961/files",
    "media_files": "https://zenodo.org/api/records/17783961/media-files",
    "thumbnails": {
      "10": "https://zenodo.org/api/iiif/record:17783961:Mixed%20Methods%20Research%20Approach_Zenodo.pdf/full/%5E10,/0/default.jpg",
      "50": "https://zenodo.org/api/iiif/record:17783961:Mixed%20Methods%20Research%20Approach_Zenodo.pdf/full/%5E50,/0/default.jpg",
      "100": "https://zenodo.org/api/iiif/record:17783961:Mixed%20Methods%20Research%20Approach_Zenodo.pdf/full/%5E100,/0/default.jpg",
      "250": "https://zenodo.org/api/iiif/record:17783961:Mixed%20Methods%20Research%20Approach_Zenodo.pdf/full/%5E250,/0/default.jpg",
      "750": "https://zenodo.org/api/iiif/record:17783961:Mixed%20Methods%20Research%20Approach_Zenodo.pdf/full/%5E750,/0/default.jpg",
      "1200": "https://zenodo.org/api/iiif/record:17783961:Mixed%20Methods%20Research%20Approach_Zenodo.pdf/full/%5E1200,/0/default.jpg"
    },
    "archive": "https://zenodo.org/api/records/17783961/files-archive",
    "archive_media": "https://zenodo.org/api/records/17783961/media-files-archive",
    "latest": "https://zenodo.org/api/records/17783961/versions/latest",
    "latest_html": "https://zenodo.org/records/17783961/latest",
    "versions": "https://zenodo.org/api/records/17783961/versions",
    "draft": "https://zenodo.org/api/records/17783961/draft",
    "access_links": "https://zenodo.org/api/records/17783961/access/links",
    "access_grants": "https://zenodo.org/api/records/17783961/access/grants",
    "access_users": "https://zenodo.org/api/records/17783961/access/users",
    "access_request": "https://zenodo.org/api/records/17783961/access/request",
    "access": "https://zenodo.org/api/records/17783961/access",
    "communities": "https://zenodo.org/api/records/17783961/communities",
    "communities-suggestions": "https://zenodo.org/api/records/17783961/communities-suggestions",
    "request_deletion": "https://zenodo.org/api/records/17783961/request-deletion",
    "file_modification": "https://zenodo.org/api/records/17783961/file-modification",
    "requests": "https://zenodo.org/api/records/17783961/requests"
  },
  "updated": "2025-12-01T20:02:54.360803-05:00",
  "recid": "17783961",
  "revision": 4,
  "files": [
    {
      "id": "d109070e-da1a-4b36-8da7-766f880ab7f9",
      "key": "Mixed Methods Research Approach_Zenodo.pdf",
      "size": 1212546,
      "checksum": "md5:c8e43341445319808eba013fc305b4d5",
      "links": {
        "self": "https://zenodo.org/api/records/17783961/files/Mixed Methods Research Approach_Zenodo.pdf/content"
      }
    }
  ],
  "swh": {},
  "owners": [
    {
      "id": "1469330"
    }
  ],
  "status": "published",
  "stats": {
    "downloads": 2,
    "unique_downloads": 1,
    "views": 2,
    "unique_views": 1,
    "version_downloads": 2,
    "version_unique_downloads": 1,
    "version_unique_views": 1,
    "version_views": 2
  },
  "state": "done",
  "submitted": true
}
